1password3
adium
airmail-beta
alfred
appcleaner
dash
dropbox
evernote
firefox
google-chrome
google-hangouts
iterm2
java
skitch
skype
slack
spotify
the-unarchiver
transmission
virtualbox
vlc
