# Add services
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'

# Install command line tools
brew 'aspell'
brew 'awscli'
brew 'bash'
brew 'bat'
brew 'bitwarden-cli'
brew 'colima'
brew 'coreutils'
brew 'dateutils'
brew 'docker'
brew 'docker-compose'
brew 'dust'
brew 'editorconfig'
brew 'enca'
brew 'entr'
brew 'fd'
brew 'fx'
brew 'fzf'
brew 'gawk'
brew 'gh'
brew 'git'
brew 'git-delta'
brew 'git-lfs'
brew 'glow'
brew 'gpg'
brew 'gsed'
brew 'hexyl'
brew 'htop'
brew 'httpie'
brew 'imagemagick'
brew 'jq'
brew 'jr'
brew 'kcat'
brew 'lsd'
brew 'luajit'
brew 'lux'
brew 'mas'
brew 'mdcat'
brew 'mise'
brew 'neofetch'
brew 'neovim'
brew 'openssl'
brew 'parallel'
brew 'pastel'
brew 'postgresql@14'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'redis'
brew 'ripgrep'
brew 'rlwrap'
brew 'shellcheck'
brew 'siege'
brew 'tlrc'
brew 'tmux'
brew 'tmux-xpanes'
brew 'tokei'
brew 'tree'
brew 'tree-sitter'
brew 'universal-ctags', args: ["HEAD"]
brew 'wader/homebrew-tap/fq'
brew 'watch'
brew 'wget'
brew 'xsv'
brew 'yt-dlp'
brew 'zlib'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-history-substring-search'
brew 'zsh-syntax-highlighting'

# Install Apps
cask '1password'
cask 'alacritty'
cask 'appcleaner'
cask 'arc'
cask 'chatgpt'
cask 'chromium'
cask 'dteoh-devdocs'
cask 'firefox-developer-edition'
cask 'google-chrome'
cask 'google-drive'
cask 'guitar-pro'
cask 'ilok-license-manager'
cask 'itsycal'
cask 'karabiner-elements'
cask 'keycastr'
cask 'linear-linear'
cask 'mimestream'
cask 'notion'
cask 'obsidian'
cask 'pop'
cask 'postico'
cask 'proton-drive'
cask 'proton-mail'
cask 'raycast'
cask 'reader'
cask 'slack'
cask 'stats'
cask 'telegram'
cask 'the-unarchiver'
cask 'visual-studio-code'
cask 'whatsapp-beta'
cask 'zoom'

mas "AdBlock", id: 1402042596
mas "BeFocusedPro", id: 961632517
mas "Bitwarden", id: 1352778147
mas "GIPHY CAPTURE", id: 668208984
mas "GarageBand", id: 682658836
mas "Harvest", id: 506189836
mas "Just Press Record", id: 1033342465
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "NordVPN", id: 905953485
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator Classic", id: 407963104
mas "Save to Reader", id: 1640236961
mas "Todoist", id: 585829637
mas "Xcode", id: 497799835

# Install fonts
cask 'font-source-code-pro'
cask 'font-fira-code'
cask 'font-fira-mono'
cask 'font-fira-code-nerd-font'
cask 'font-fira-mono-nerd-font'
