# Add services
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/services'
tap 'mongodb/brew'
tap 'neovim/neovim'

# Install command line tools
brew 'aria2'
brew 'asdf'
brew 'awscli'
brew 'bash'
brew 'bat'
brew 'bats'
brew 'bitwarden-cli'
brew 'coreutils'
brew 'dateutils'
brew 'dust'
brew 'editorconfig'
brew 'enca'
brew 'fd'
brew 'fzf'
brew 'gawk'
brew 'git'
brew 'git-delta'
brew 'git-lfs'
brew 'glow'
brew 'gpg'
brew 'hexyl'
brew 'htop'
brew 'httpie'
brew 'hub'
brew 'imagemagick'
brew 'ispell'
brew 'jq'
brew 'leiningen'
brew 'luajit'
brew 'mas'
brew 'mdcat'
brew 'mongodb/brew/mongodb-community'
brew 'mutagen-io/mutagen/mutagen'
brew 'neovim'
brew 'openssl'
brew 'parallel'
brew 'pastel'
brew 'postgresql'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'redis'
brew 'ripgrep'
brew 'rlwrap'
brew 'shellcheck'
brew 'siege'
brew 'tmux'
brew 'tmux-xpanes'
brew 'tokei'
brew 'tree'
brew 'universal-ctags/universal-ctags/universal-ctags', args: ["HEAD"]
brew 'watch'
brew 'wget'
brew 'xsv'
brew 'youtube-dl'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-history-substring-search'
brew 'zsh-syntax-highlighting'

# Install Apps
cask_args appdir: "/Applications", require_sha: true
cask 'alacritty'
cask 'alfred3'
cask 'appcleaner'
cask 'deepl'
cask 'dash4'
cask 'docker'
cask 'dropbox'
cask 'firefox-developer-edition'
cask 'google-chrome'
cask 'guitar-pro'
cask 'itsycal'
cask 'karabiner-elements'
cask 'keybase'
cask 'notion'
cask 'scaleft'
cask 'sequel-pro'
cask 'skype'
cask 'slack'
cask 'spotify'
cask 'telegram'
cask 'the-unarchiver'
cask 'transmission'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'

mas '1Password 7', id: 1333542190 
mas 'BeFocusedPro', id: 961632517
mas 'Bitwarden' id: 1352778147
mas 'GarageBand', id: 682658836
mas 'Gyphi', id: 668208984
mas 'Harvest', id: 506189836
mas 'Just Press Record', id: 979561272
mas 'Pixelmator Classic', id: 407963104
mas 'Pocket', id: 568494494
mas 'Todoist', id: 585829637

# Install fonts
cask 'font-source-code-pro'
cask 'font-fira-code'
cask 'font-fira-mono'
