# Add services
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'

# Install command line tools
brew 'asdf'
brew 'aspell'
brew 'awscli'
brew 'bash'
brew 'bat'
brew 'bitwarden-cli'
brew 'colima'
brew 'coreutils'
brew 'dateutils'
brew 'docker'
brew 'docker-compose'
brew 'dust'
brew 'editorconfig'
brew 'enca'
brew 'entr'
brew 'fd'
brew 'fx'
brew 'fzf'
brew 'gawk'
brew 'gh'
brew 'git'
brew 'git-delta'
brew 'git-lfs'
brew 'glow'
brew 'gpg'
brew 'gsed'
brew 'hexyl'
brew 'htop'
brew 'httpie'
brew 'imagemagick'
brew 'jq'
brew 'lsd'
brew 'luajit'
brew 'mas'
brew 'mdcat'
brew 'neovim'
brew 'openssl'
brew 'parallel'
brew 'pastel'
brew 'postgresql'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'redis'
brew 'ripgrep'
brew 'rlwrap'
brew 'shellcheck'
brew 'siege'
brew 'tmux'
brew 'tmux-xpanes'
brew 'tokei'
brew 'tree'
brew 'universal-ctags/universal-ctags/universal-ctags', args: ["HEAD"]
brew 'wader/homebrew-tap/fq'
brew 'watch'
brew 'wget'
brew 'xsv'
brew 'yt-dlp'
brew 'zlib'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-history-substring-search'
brew 'zsh-syntax-highlighting'

# Install Apps
cask_args require_sha: true
cask 'alacritty'
cask 'appcleaner'
cask 'chromium'
cask 'drawio'
cask 'dteoh-devdocs'
cask 'firefox-developer-edition'
cask 'google-chrome'
cask 'google-drive'
cask 'guitar-pro'
cask 'ilok-license-manager'
cask 'itsycal'
cask 'karabiner-elements'
cask 'keybase'
cask 'keycastr'
cask 'mimestream'
cask 'notion'
cask 'obsidian'
cask 'proton-drive'
cask 'raycast'
cask 'sequel-pro'
cask 'skype'
cask 'slack'
cask 'stats'
cask 'telegram'
cask 'the-unarchiver'
cask 'transmission'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp-beta'
cask 'zoom'

mas 'BeFocusedPro', id: 961632517
mas 'Bitwarden', id: 1352778147
mas 'GarageBand', id: 682658836
mas 'Gyphi', id: 668208984
mas 'Kindle', id: 302584613
mas 'Harvest', id: 506189836
mas 'Just Press Record', id: 979561272
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Pixelmator Classic', id: 407963104
mas 'Todoist', id: 585829637
mas 'Xcode', id: 497799835
mas 'NordVPN', id: 905953485

# Install fonts
cask 'font-source-code-pro'
cask 'font-fira-code'
cask 'font-fira-mono'
cask 'font-fira-code-nerd-font'
cask 'font-fira-mono-nerd-font'
